RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_hal_comp.h
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup COMP_Exported_Constants COMP Exported Constants
  * @{
  */

/** @defgroup COMP_Error_Code COMP Error Code
  * @{
  */
#define HAL_COMP_ERROR_NONE             (0x00UL)   /*!< No error */
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1U)
#define HAL_COMP_ERROR_INVALID_CALLBACK (0x01U)   /*!< Invalid Callback error */
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup COMP_PowerMode COMP power mode
  * @{
  */
/* Note: For the characteristics of comparator power modes                    */
/*       (propagation delay and power consumption),                           */
/*       refer to device datasheet.                                           */
#define COMP_POWERMODE_HIGHSPEED       (0x00000000UL)         /*!< High Speed */
#define COMP_POWERMODE_MEDIUMSPEED     (COMP_CFGR1_PWRMODE_0) /*!< Medium Speed */
#define COMP_POWERMODE_ULTRALOWPOWER   (COMP_CFGR1_PWRMODE)   /*!< Ultra-low power mode */
/**
  * @}
  */

/** @defgroup COMP_InputPlus COMP input plus (non-inverting input)
  * @{
  */
#define COMP_INPUT_PLUS_IO1            (0x00000000UL)         /*!< Comparator input plus connected to IO1 (pin PB0) */
#define COMP_INPUT_PLUS_IO2            (COMP_CFGR2_INPSEL0)   /*!< Comparator input plus connected to IO2 (pin PA0) */
#define COMP_INPUT_PLUS_IO3            (COMP_CFGR1_INPSEL1)   /*!< Comparator input plus connected to IO3 (pin PB2) */
#define COMP_INPUT_PLUS_DAC1_CH1       (COMP_CFGR1_INPSEL2)   /*!< Comparator input plus connected to (DAC1_CH1) */
/**
  * @}
  */

/** @defgroup COMP_InputMinus COMP input minus (inverting input)
  * @{
  */
#define COMP_INPUT_MINUS_1_4VREFINT  (COMP_CFGR1_SCALEN |\
                                      COMP_CFGR1_BRGEN)       /*!< Comparator input minus connected to 1/4 VrefInt    */
#define COMP_INPUT_MINUS_1_2VREFINT  (COMP_CFGR1_INMSEL_0 |\
                                      COMP_CFGR1_SCALEN |\
                                      COMP_CFGR1_BRGEN)       /*!< Comparator input minus connected to 1/2 VrefInt    */
#define COMP_INPUT_MINUS_3_4VREFINT  (COMP_CFGR1_INMSEL_1 |\
                                      COMP_CFGR1_SCALEN |\
                                      COMP_CFGR1_BRGEN)       /*!< Comparator input minus connected to 3/4 VrefInt    */
#define COMP_INPUT_MINUS_VREFINT     (COMP_CFGR1_INMSEL_1 |\
                                      COMP_CFGR1_INMSEL_0 |\
                                      COMP_CFGR1_SCALEN)      /*!< Comparator input minus connected to VrefInt        */
#define COMP_INPUT_MINUS_DAC1_CH1    (COMP_CFGR1_INMSEL_2)    /*!< Comparator input minus connected to DAC1 channel 1 */
#define COMP_INPUT_MINUS_IO1         (COMP_CFGR1_INMSEL_2 |\
                                      COMP_CFGR1_INMSEL_0)    /*!< Comparator input minus connected to IO1 (pin PC4)  */
#define COMP_INPUT_MINUS_IO2         (COMP_CFGR1_INMSEL_2 |\
                                      COMP_CFGR1_INMSEL_1)    /*!< Comparator input minus connected to IO2 (pin PB1)  */
#define COMP_INPUT_MINUS_IO3         (COMP_CFGR1_INMSEL_2 |\
                                      COMP_CFGR1_INMSEL_1 |\
                                      COMP_CFGR1_INMSEL_0)    /*!< Comparator input minus connected to IO3 (pin PA5)  */
#define COMP_INPUT_MINUS_TEMPSENSOR  (COMP_CFGR1_INMSEL_3)    /*!< Comparator input minus connected to internal
                                     temperature sensor (also accessible through ADC peripheral) */
#define COMP_INPUT_MINUS_VBAT        (COMP_CFGR1_INMSEL_3 |\
                                      COMP_CFGR1_INMSEL_0)    /*!< Comparator input minus connected to Vbat/4:
                                     Vbat voltage through a divider ladder of factor 1/4 to have input voltage
                                     always below Vdda. */

/**
  * @}
  */

/** @defgroup COMP_Hysteresis COMP hysteresis
  * @{
  */
#define COMP_HYSTERESIS_NONE           (0x00000000UL)                       /*!< No hysteresis */
#define COMP_HYSTERESIS_LOW            (COMP_CFGR1_HYST_0)                  /*!< Hysteresis level low */
#define COMP_HYSTERESIS_MEDIUM         (COMP_CFGR1_HYST_1)                  /*!< Hysteresis level medium */
#define COMP_HYSTERESIS_HIGH           (COMP_CFGR1_HYST_0 | COMP_CFGR1_HYST_1) /*!< Hysteresis level high */
/**
  * @}
  */

/** @defgroup COMP_OutputPolarity COMP output Polarity
  * @{
  */
#define COMP_OUTPUTPOL_NONINVERTED     (0x00000000UL)          /*!< COMP output level is not inverted (comparator output
                                                                    is high when the input plus is at a higher voltage
                                                                    than the input minus) */
#define COMP_OUTPUTPOL_INVERTED        (COMP_CFGR1_POLARITY)   /*!< COMP output level is inverted (comparator output is
                                                                    low when the input plus is at a higher voltage than
                                                                    the input minus) */
/**
  * @}
  */

/** @defgroup COMP_BlankingSrce  COMP blanking source
  * @{
  */
#define COMP_BLANKINGSRC_NONE            (0x00000000UL)           /*!< Comparator output without blanking */
#define COMP_BLANKINGSRC_TIM1_OC5        (COMP_CFGR1_BLANKING_0)  /*!< TIM1 OC5 selected as blanking source */
#define COMP_BLANKINGSRC_TIM2_OC3        (COMP_CFGR1_BLANKING_1)  /*!< TIM2 OC3 selected as blanking source */
#define COMP_BLANKINGSRC_TIM3_OC3        (COMP_CFGR1_BLANKING_0 |\
                                          COMP_CFGR1_BLANKING_1)  /*!< TIM3 OC3 selected as blanking source */
#define COMP_BLANKINGSRC_TIM3_OC4        (COMP_CFGR1_BLANKING_2)  /*!< TIM3 OC4 selected as blanking source */
#define COMP_BLANKINGSRC_LPTIM1_OC2      (COMP_CFGR1_BLANKING_2 |\
                                          COMP_CFGR1_BLANKING_0)  /*!< LPTIM1 OC2 selected as blanking source */
#define COMP_BLANKINGSRC_LPTIM2_OC2      (COMP_CFGR1_BLANKING_2 |\
                                          COMP_CFGR1_BLANKING_1)  /*!< LPTIM2 OC2 selected as blanking source */
/**
  * @}
  */

